inst/CR/BT-CRnotes.tex

\section{Survival}
\label{sec:org196bc76}
\subsection{Relationship between \(\Delta\) and the hazard ratio}
\label{sec:orgc7c701d}
For a given cumulative density function \(F(x)\) and a corresponding
probability density function \(f(x)\) we define the hazard by:
\begin{align*}
\lambda(t) &=  \left. \frac{\Prob[t\leq T \leq t+h|T\geq t]}{h}\right|_{h \rightarrow 0^+} \\
&= \left. \frac{\Prob[t\leq T \leq t+h]}{\Prob[T\geq t]h}\right|_{h \rightarrow 0^+} \\
&= \frac{f(t)}{1-F(t)}
\end{align*}

\bigskip

Let now consider two times to events following an exponential distribution:
\begin{itemize}
\item \(X \sim Exp(\alpha_1)\). The corresponding hazard function is \(\lambda(t)=\alpha_1\).
\item \(Y \sim Exp(\alpha_2)\). The corresponding hazard function is \(\lambda(t)=\alpha_2\).
\end{itemize}
So the hazad ratio is \(HR = \frac{\lambda_2}{\lambda_1}\). Note that if we use a cox model we will have:
\begin{align*}
\lambda(t) = \lambda_0(t) \exp(\beta \Ind[group])
\end{align*}
where \(\exp(\beta)\) is the hazard ratio.

\bigskip

\begin{align*}
\Prob[Y>X] &= \int_{0}^{\infty}\alpha_1 \exp(-\alpha_1 x)  \int_x^{\infty} \alpha_2 \exp(-\alpha_2 y) dy dx \\
&= \int_{0}^{\infty}\alpha_1 \exp(-\alpha_1 x)  [ \exp(-\alpha_2 y) ]_{\infty}^{x} dx \\
&= \int_{0}^{\infty}\alpha_1 \exp(-\alpha_1 x) \exp(-\alpha_2 x) dx \\
&= \frac{\alpha_1}{\alpha_1+\alpha_2} [\exp(-(\alpha_1+\alpha_2) x)]_{\infty}^{0} \\
&= \frac{\alpha_1}{\alpha_1+\alpha_2}\\
&= \frac{1}{1+HR}\\
\end{align*}

So:
\begin{align*}
\Delta = 2\frac{1}{1+HR}-1 = \frac{1-HR}{1+HR}
\end{align*}

\subsection{Scoring rule in presence of censoring}
\label{sec:org784262a}
Let's consider the following random variables:  
\begin{itemize}
\item \(X\) the time to the occurrence of the event of interest in the treatment group.
\item \(C_X\) the censoring time in the treatment group.
\item \(X^* = X \wedge C_X\) the observed event time in the treatment group.
\item \(\varepsilon_X = \Ind[X \leq C_X]\) the event time indicator in the treatment group.
\item \(Y\) the time to the occurrence of the event of interest in the control group.
\item \(C_Y\) the censoring time in the control group.
\item \(Y^* = Y \wedge C_Y\) the observed event time in the control group.
\item \(\varepsilon_Y = \Ind[Y \leq C_Y]\) the event time indicator in the control group.
\end{itemize}

We observe one realization \(\left(x^*, y^*, e_X, e_Y \right)\) of the
random variables \(\left(X^*, Y^*, \varepsilon_X, \varepsilon_Y
\right)\). We use the short notation \(x \wedge y = min(x,y)\) and \(x \vee y = max(x,y)\).

\subsubsection{Case: \(e_X=0,e_Y=1\)}
\label{sec:org5adcbd5}

\textbf{Probability in favor of the treatment}:
\begin{align*}
\Prob[x \geq y + \tau | x \geq x^*, y = y^*] 
&= \frac{ \Prob[x \geq y^* + \tau, x \geq x^*] }{ \Prob[x \geq x^*]} \\
&= \frac{ \Prob[x \geq max(y^* + \tau,x^*)] }{\Prob[x \geq x^*]} \\
&= \frac{ S_X(y^* + \tau \vee x^*)}{S_X(x^*)}
\end{align*}

In the case where \(x^* < y^* + \tau\), we need an estimate of
\(S_X(y^* + \tau)\) to compute the probability in favor of the
treatment. If we can only have an estimate of \(S_X\) up to
\(x_{max} < y^* + \tau\) then we can use the following inequality:
\begin{align*}
S_X(y^* + \tau) &\geq 0 \\
\Prob[x \geq y + \tau | x \geq x^*, y = y^*] &\geq 0 \\
\end{align*}

\textbf{Probability in favor of the control}:

\begin{align*}
\Prob[y \geq x + \tau | x \geq x^*, y = y^*] 
&= 1 - \frac{ \Prob[x \geq y^* - \tau, x \geq x^*] }{ \Prob[x \geq x^*]} \\
&= 1 - \frac{ \Prob[x \geq max(y^* - \tau,x^*)] }{\Prob[x \geq x^*]} \\
&= 1 - \frac{ S_X(y^* - \tau \vee x^*)}{S_X(x^*)}
\end{align*}

In the case where \(x^* < y^* - \tau\), we need an estimate of
\(S_X(y^* - \tau)\) to compute the probability in favor of the
control. If we can only have an estimate of \(S_X\) up to
\(x_{max} < y^* - \tau\) then we can use the following inequality:
\begin{align*}
S_X(x_{max}) &\geq S_X(y^* - \tau) \\
\Prob[x \geq y - \tau | x \geq x^*, y = y^*] &\geq 1 - \frac{ S_X(x_{max})}{S_X(x^*)} \\
\end{align*}

\textbf{Probability of being neutral}:

\begin{align*}
\Prob[|x-y| \leq \tau | x \geq x^*, y = y^*] 
&= 1-\Prob[x \geq y + \tau | x \geq x^*, y = y^*]-\Prob[y \geq x + \tau | x \geq x^*, y = y^*]  \\
&= \frac{ S_X(y^* - \tau \vee x^*) - S_X(y^* + \tau \vee x^*)}{S_X(x^*)}
\end{align*}

Consider the case \(x^*\)
If \(x_{max} > y^* - \tau\) then 
\begin{align*}
\Prob[|x-y| \leq \tau | x \geq x^*, y = y^*] \geq \frac{ S_X(y^* - \tau) - S_X(x_{max})}{S_X(x^*)}
\end{align*}
otherwise
\begin{align*}
\Prob[|x-y| \leq \tau | x \geq x^*, y = y^*] \geq 0
\end{align*}

\textbf{Probability of being uninformative}: It is computed as the complement
to 1 of the sum of the probability of being in favor of the treatment,
in favor of the control, and neutral.

\bigskip

\textsc{Example}:

\begin{itemize}
\item when \(x^* > y^* + \tau\), the probability of being favorable is 1
so the probability of being uninformative is 0.

\item when \(\left|x^* - y^*\right| < \tau\), the probability of being in
favor of the control is 0. If we know the survival in the treatment
group up to time \(y^*\), then we can only say that the probability
of being favorable is bounded below by 0. The probability of being
neutral bounded below by \(1-S_T(y^*)/S_T(x^*)\). The probability of
being uninformative is then \(S_T(y^*)/S_T(x^*)\). Clearly this
probability becomes small when \(S_T(y^*)\) is small. The
approximation by the lower bound becomes exact when \(S_T(y^*)\)
tends to 0.
\end{itemize}

\subsection{In R}
\label{sec:org9dbfd50}

Settings:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
alphaX <- 2
alphaY <- 1
\end{lstlisting}

Simulate data:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
set.seed(10)
df <- rbind(data.frame(time = rexp(n, rate = alphaX), group = "C", event = 1),
			data.frame(time = rexp(n, rate = alphaY), group = "T", event = 1))
\end{lstlisting}

Buyse test:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
BuyseTest(group ~ tte(time, censoring = event), data = df,
		  method.inference = "none", trace = 0, method.tte = "Gehan")
\end{lstlisting}
\begin{verbatim}
endpoint threshold  delta  Delta
    time     1e-12 0.3403 0.3403
\end{verbatim}

Expected:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.coxph <- coxph(Surv(time,event)~group,data = df)
HR <- as.double(exp(coef(e.coxph)))
c("HR" = alphaY/alphaX, "Delta" = 2*alphaX/(alphaY+alphaX)-1)
c("HR.cox" = HR, "Delta" = (1-HR)/(1+HR))
\end{lstlisting}

\begin{verbatim}
       HR     Delta 
0.5000000 0.3333333
   HR.cox     Delta 
0.4918256 0.3406392
\end{verbatim}

\clearpage
