inst/CR/BT-CRnotes.tex

\subsection{In R}
\label{sec:org991f98c}

\subsubsection{BuyseTest (no censoring)}
\label{sec:org0b682ca}

Setting:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
alphaE.X <- 2
alphaCR.X <- 1
alphaE.Y <- 3
alphaCR.Y <- 2
\end{lstlisting}

Simulate data:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
set.seed(10)
df <- rbind(data.frame(time1 = rexp(n, rate = alphaE.X), time2 = rexp(n, rate = alphaCR.X), group = "1"),
			data.frame(time1 = rexp(n, rate = alphaE.Y), time2 = rexp(n, rate = alphaCR.Y), group = "2"))
df$time <- pmin(df$time1,df$time2) ## first event
df$event <- (df$time2<df$time1)+1 ## type of event
\end{lstlisting}

BuyseTest:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.BT <- BuyseTest(group ~ tte(time, censoring = event), data = df,
				  method.inference = "none", method.tte = "Gehan",
				  trace = 0)
summary(e.BT, percentage = TRUE)
\end{lstlisting}

\begin{verbatim}
       Generalized pairwise comparison with 1 prioritized endpoint

> statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> treatment groups: 1 (control) vs. 2 (treatment) 
> censored pairs  : uninformative pairs

> results
endpoint threshold total favorable unfavorable neutral uninf   delta   Delta
    time     1e-12   100      41.6       45.12   13.28     0 -0.0352 -0.0352
\end{verbatim}

Note that without censoring one can get the same results by treating
time as a continuous variable that take value \(\infty\) when the
competing risk is observed:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
df$timeXX <- df$time
df$timeXX[df$event==2] <- max(df$time)+1
e.BT.bis <- BuyseTest(group ~ cont(timeXX), data = df,
				  method.inference = "none", trace = 0)
summary(e.BT.bis, percentage = TRUE)
\end{lstlisting}

\begin{verbatim}
       Generalized pairwise comparison with 1 prioritized endpoint

> statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> treatment groups: 1 (control) vs. 2 (treatment) 
> results
endpoint threshold total favorable unfavorable neutral uninf   delta   Delta
  timeXX     1e-12   100      41.6       45.12   13.28     0 -0.0352 -0.0352
\end{verbatim}

Expected:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
weight <- (alphaE.X+alphaCR.X)*(alphaE.Y+alphaCR.Y)
exp <- list()
exp$favorable <- 1/weight*(alphaE.X*alphaE.Y*alphaE.X/(alphaE.X+alphaE.Y)+(alphaE.X*alphaCR.Y))
exp$unfavorable <- 1/weight*(alphaE.X*alphaE.Y*alphaE.Y/(alphaE.X+alphaE.Y)+(alphaE.Y*alphaCR.X))
exp$neutral <- alphaCR.X*alphaCR.Y/weight

100*unlist(exp)
\end{lstlisting}

\begin{verbatim}
favorable unfavorable     neutral 
 42.66667    44.00000    13.33333
\end{verbatim}

\subsubsection{BuyseTest (with censoring)}
\label{sec:org4a0a387}

Simulate data:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
df$eventC <- df$event
df$eventC[rbinom(n, size = 1, prob = 0.2)==1] <- 0
\end{lstlisting}

BuyseTest (biased):
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.BTC <- BuyseTest(group ~ tte(time, censoring = eventC), data = df,
				   method.inference = "none", method.tte = "Gehan",
				   trace = 0)
summary(e.BTC, percentage = TRUE)
\end{lstlisting}

\begin{verbatim}
       Generalized pairwise comparison with 1 prioritized endpoint

> statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> treatment groups: 1 (control) vs. 2 (treatment) 
> censored pairs  : uninformative pairs

> results
endpoint threshold total favorable unfavorable neutral uninf   delta   Delta
    time     1e-12   100      31.1       35.15    8.65  25.1 -0.0406 -0.0406
\end{verbatim}

BuyseTest (unbiased):
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.BTCC <- BuyseTest(group ~ tte(time, censoring = eventC), data = df,
				   method.inference = "none", method.tte = "Gehan corrected",
				   trace = 0)
summary(e.BTCC, percentage = TRUE)
\end{lstlisting}

\begin{verbatim}
       Generalized pairwise comparison with 1 prioritized endpoint

> statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
> null hypothesis : Delta == 0 
> treatment groups: 1 (control) vs. 2 (treatment) 
> censored pairs  : uninformative pairs
                    IPW for uninformative pairs

> results
endpoint threshold total favorable unfavorable neutral uninf   delta   Delta
    time     1e-12   100     41.52       46.94   11.54     0 -0.0542 -0.0542
\end{verbatim}

\subsubsection{Cumulative incidence}
\label{sec:org3a7e482}

Settings:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
alphaE <- 2
alphaCR <- 1
\end{lstlisting}

Simulate data:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
set.seed(10)
df <- data.frame(time1 = rexp(n, rate = alphaE), time2 = rexp(n, rate = alphaCR), group = "1", event = 1)
df$time <- pmin(df$time1,df$time2)
df$event <- (df$time2<df$time1)+1
\end{lstlisting}

Cumulative incidence (via risk regression):
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.CSC <- CSC(Hist(time, event) ~ 1, data = df)
vec.times <- unique(round(exp(seq(log(min(df$time)),log(max(df$time)),length.out = 12)),2))
e.CSCpred <- predict(e.CSC, newdata = data.frame(X = 1), time = vec.times , cause = 1)
\end{lstlisting}

Expected vs. calculated:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
cbind(time = vec.times,
	  CSC = e.CSCpred$absRisk[1,],
	  manual = alphaE/(alphaE+alphaCR)*(1-exp(-(alphaE+alphaCR)*(vec.times)))
	  )
\end{lstlisting}

\begin{verbatim}
     time    CSC     manual
[1,] 0.00 0.0000 0.00000000
[2,] 0.01 0.0186 0.01970298
[3,] 0.02 0.0377 0.03882364
[4,] 0.05 0.0924 0.09286135
[5,] 0.14 0.2248 0.22863545
[6,] 0.42 0.4690 0.47756398
[7,] 1.24 0.6534 0.65051069
[8,] 3.70 0.6703 0.66665659
\end{verbatim}

Could also be obtained treating the outcome as binary:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
mean((df$time<=1)*(df$event==1))
\end{lstlisting}

\begin{verbatim}
[1] 0.6375
\end{verbatim}
\end{document}